app/controllers/api/showtimes_controller.rb

  def index
    @showtimes = Showtime.all
---
SELECT "showtimes".* FROM "showtimes"

  def show
    @showtime = Showtime.find(params[:id])
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = $1 LIMIT 1  [["id", 1]]